---
type: ExportLineweightTable
namespace: Autodesk.Revit.DB
version: 2024
members: 15
tags: [revit-api, class]
---

# ExportLineweightTable

`Autodesk.Revit.DB.ExportLineweightTable` · Revit 2024 · 15 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ExportLineweightTable | — | `public ExportLineweightTable ()` |
| Method | Add | — | `public void Add ( ExportLineweightKey exportLineweightKey , ExportLineweightInfo exportLineweightInfo )` |
| Method | Clear | — | `public void Clear ()` |
| Method | ContainsKey | — | `public bool ContainsKey ( ExportLineweightKey exportLineweightKey )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetBasicIEnumerator | — | `internal virtual IEnumerator GetBasicIEnumerator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator < KeyValuePair < ExportLineweightKey , ExportLineweightInfo >> GetEnumerator ()` |
| Method | GetExportLineweightInfo | — | `public ExportLineweightInfo GetExportLineweightInfo ( ExportLineweightKey exportLineweightKey )` |
| Method | GetKeys | — | `public IList < ExportLineweightKey > GetKeys ()` |
| Method | GetLineweightTableIterator | — | `public ExportLineweightTableIterator GetLineweightTableIterator ()` |
| Method | GetValues | — | `public IList < ExportLineweightInfo > GetValues ()` |
| Method | Remove | — | `public void Remove ( ExportLineweightKey exportLineweightKey )` |
| Property | Count | — | `public int Count { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Item | 2014 | `public ExportLineweightInfo this [ ExportLineweightKey lineweightKey ] { get ; set ; }` |